MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M481LGCAEU/mcu.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M4 Processor and Core Peripherals */
#define __CM4_REV                 0x0201UL    /*!< Core Revision r2p1                               */
#define __NVIC_PRIO_BITS          4UL         /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig    0UL         /*!< Set to 1 if different SysTick Config is used     */
#define __MPU_PRESENT             1UL         /*!< MPU present or not                               */
#ifdef __FPU_PRESENT
#undef __FPU_PRESENT
#define __FPU_PRESENT             1UL         /*!< FPU present or not                               */
#else
#define __FPU_PRESENT             1UL         /*!< FPU present or not                               */
#endif

/*@}*/ /* end of group CMSIS_Device */


#include "core_cm4.h"               /* Cortex-M4 processor and core peripherals           */
// Note: Changed for MikroE implementation.
//#include "system_M480.h"            /* System include file                         */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>
// Note: Changed for MikroE implementation.
//#include <stdint.h>



#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                            Register definitions                            */
/******************************************************************************/

// Note: Changed for MikroE implementation.
//#include "sys_reg.h"
// Note: Changed for MikroE implementation.
//#include "clk_reg.h"
// Note: Changed for MikroE implementation.
//#include "fmc_reg.h"
// Note: Changed for MikroE implementation.
//#include "gpio_reg.h"
// Note: Changed for MikroE implementation.
//#include "pdma_reg.h"
// Note: Changed for MikroE implementation.
//#include "timer_reg.h"
// Note: Changed for MikroE implementation.
//#include "wdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "wwdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "rtc_reg.h"
// Note: Changed for MikroE implementation.
//#include "epwm_reg.h"
// Note: Changed for MikroE implementation.
//#include "bpwm_reg.h"
// Note: Changed for MikroE implementation.
//#include "qei_reg.h"
// Note: Changed for MikroE implementation.
//#include "ecap_reg.h"
// Note: Changed for MikroE implementation.
//#include "uart_reg.h"
// Note: Changed for MikroE implementation.
//#include "emac_reg.h"
// Note: Changed for MikroE implementation.
//#include "sc_reg.h"
// Note: Changed for MikroE implementation.
//#include "i2s_reg.h"
// Note: Changed for MikroE implementation.
//#include "spi_reg.h"
// Note: Changed for MikroE implementation.
//#include "qspi_reg.h"
// Note: Changed for MikroE implementation.
//#include "spim_reg.h"
// Note: Changed for MikroE implementation.
//#include "i2c_reg.h"
// Note: Changed for MikroE implementation.
//#include "uuart_reg.h"
// Note: Changed for MikroE implementation.
//#include "uspi_reg.h"
// Note: Changed for MikroE implementation.
//#include "ui2c_reg.h"
// Note: Changed for MikroE implementation.
//#include "can_reg.h"
// Note: Changed for MikroE implementation.
//#include "sdh_reg.h"
// Note: Changed for MikroE implementation.
//#include "ebi_reg.h"
// Note: Changed for MikroE implementation.
//#include "usbd_reg.h"
// Note: Changed for MikroE implementation.
//#include "hsusbd_reg.h"
// Note: Changed for MikroE implementation.
//#include "usbh_reg.h"
// Note: Changed for MikroE implementation.
//#include "hsusbh_reg.h"
// Note: Changed for MikroE implementation.
//#include "otg_reg.h"
// Note: Changed for MikroE implementation.
//#include "hsotg_reg.h"
// Note: Changed for MikroE implementation.
//#include "crc_reg.h"
// Note: Changed for MikroE implementation.
//#include "crypto_reg.h"
// Note: Changed for MikroE implementation.
//#include "trng_reg.h"
// Note: Changed for MikroE implementation.
//#include "eadc_reg.h"
// Note: Changed for MikroE implementation.
//#include "dac_reg.h"
// Note: Changed for MikroE implementation.
//#include "acmp_reg.h"
// Note: Changed for MikroE implementation.
//#include "opa_reg.h"
// Note: Changed for MikroE implementation.
//#include "ccap_reg.h"


/** @addtogroup PERIPHERAL_MEM_MAP Peripheral Memory Base
  Memory Mapped Structure for Peripherals
  @{
 */
/* Peripheral and SRAM base address */
#define FLASH_BASE           ((uint32_t)0x00000000)      /*!< Flash base address      */
#define SRAM_BASE            ((uint32_t)0x20000000)      /*!< SRAM Base Address       */
#define PERIPH_BASE          ((uint32_t)0x40000000)      /*!< Peripheral Base Address */
#define AHBPERIPH_BASE       PERIPH_BASE                 /*!< AHB Base Address */
#define APBPERIPH_BASE       (PERIPH_BASE + (uint32_t)0x00040000)  /*!< APB Base Address */

/*!< AHB peripherals */
#define SYS_BASE               (AHBPERIPH_BASE + 0x00000UL)
#define CLK_BASE               (AHBPERIPH_BASE + 0x00200UL)
#define NMI_BASE               (AHBPERIPH_BASE + 0x00300UL)
#define GPIOA_BASE             (AHBPERIPH_BASE + 0x04000UL)
#define GPIOB_BASE             (AHBPERIPH_BASE + 0x04040UL)
#define GPIOC_BASE             (AHBPERIPH_BASE + 0x04080UL)
#define GPIOD_BASE             (AHBPERIPH_BASE + 0x040C0UL)
#define GPIOE_BASE             (AHBPERIPH_BASE + 0x04100UL)
#define GPIOF_BASE             (AHBPERIPH_BASE + 0x04140UL)
#define GPIOG_BASE             (AHBPERIPH_BASE + 0x04180UL)
#define GPIOH_BASE             (AHBPERIPH_BASE + 0x041C0UL)
#define GPIOI_BASE             (AHBPERIPH_BASE + 0x04200UL)
#define GPIO_DBCTL_BASE        (AHBPERIPH_BASE + 0x04440UL)
#define GPIO_PIN_DATA_BASE     (AHBPERIPH_BASE + 0x04800UL)
#define PDMA_BASE              (AHBPERIPH_BASE + 0x08000UL)
#define USBH_BASE              (AHBPERIPH_BASE + 0x09000UL)
#define HSUSBH_BASE            (AHBPERIPH_BASE + 0x1A000UL)
#define EMAC_BASE              (AHBPERIPH_BASE + 0x0B000UL)
#define FMC_BASE               (AHBPERIPH_BASE + 0x0C000UL)
#define SDH0_BASE              (AHBPERIPH_BASE + 0x0D000UL)
#define SDH1_BASE              (AHBPERIPH_BASE + 0x0E000UL)
#define EBI_BASE               (AHBPERIPH_BASE + 0x10000UL)
#define HSUSBD_BASE            (AHBPERIPH_BASE + 0x19000UL)
#define CCAP_BASE              (AHBPERIPH_BASE + 0x30000UL)
#define CRC_BASE               (AHBPERIPH_BASE + 0x31000UL)
#define TAMPER_BASE            (AHBPERIPH_BASE + 0xE1000UL)

/*!< APB2 peripherals */
#define WDT_BASE              (APBPERIPH_BASE + 0x00000UL)
#define WWDT_BASE             (APBPERIPH_BASE + 0x00100UL)
#define OPA_BASE              (APBPERIPH_BASE + 0x06000UL)
#define I2S_BASE              (APBPERIPH_BASE + 0x08000UL)
#define EADC1_BASE            (APBPERIPH_BASE + 0x0B000UL)
#define TIMER0_BASE           (APBPERIPH_BASE + 0x10000UL)
#define TIMER1_BASE           (APBPERIPH_BASE + 0x10100UL)
#define EPWM0_BASE            (APBPERIPH_BASE + 0x18000UL)
#define BPWM0_BASE            (APBPERIPH_BASE + 0x1A000UL)
#define QSPI0_BASE            (APBPERIPH_BASE + 0x20000UL)
#define SPI1_BASE             (APBPERIPH_BASE + 0x22000UL)
#define SPI3_BASE             (APBPERIPH_BASE + 0x24000UL)
#define UART0_BASE            (APBPERIPH_BASE + 0x30000UL)
#define UART2_BASE            (APBPERIPH_BASE + 0x32000UL)
#define UART4_BASE            (APBPERIPH_BASE + 0x34000UL)
#define UART6_BASE            (APBPERIPH_BASE + 0x36000UL)
#define I2C0_BASE             (APBPERIPH_BASE + 0x40000UL)
#define I2C2_BASE             (APBPERIPH_BASE + 0x42000UL)
#define CAN0_BASE             (APBPERIPH_BASE + 0x60000UL)
#define CAN2_BASE             (APBPERIPH_BASE + 0x62000UL)
#define QEI0_BASE             (APBPERIPH_BASE + 0x70000UL)
#define ECAP0_BASE            (APBPERIPH_BASE + 0x74000UL)
#define USCI0_BASE            (APBPERIPH_BASE + 0x90000UL)


/*!< APB1 peripherals */
#define RTC_BASE              (APBPERIPH_BASE + 0x01000UL)
#define EADC_BASE             (APBPERIPH_BASE + 0x03000UL)
#define ACMP01_BASE           (APBPERIPH_BASE + 0x05000UL)
#define USBD_BASE             (APBPERIPH_BASE + 0x80000UL)
#define OTG_BASE              (APBPERIPH_BASE + 0x0D000UL)
#define HSOTG_BASE            (APBPERIPH_BASE + 0x0F000UL)
#define TIMER2_BASE           (APBPERIPH_BASE + 0x11000UL)
#define TIMER3_BASE           (APBPERIPH_BASE + 0x11100UL)
#define EPWM1_BASE            (APBPERIPH_BASE + 0x19000UL)
#define BPWM1_BASE            (APBPERIPH_BASE + 0x1B000UL)
#define SPI0_BASE             (APBPERIPH_BASE + 0x21000UL)
#define SPI2_BASE             (APBPERIPH_BASE + 0x23000UL)
#define QSPI1_BASE            (APBPERIPH_BASE + 0x29000UL)
#define UART1_BASE            (APBPERIPH_BASE + 0x31000UL)
#define UART3_BASE            (APBPERIPH_BASE + 0x33000UL)
#define UART5_BASE            (APBPERIPH_BASE + 0x35000UL)
#define UART7_BASE            (APBPERIPH_BASE + 0x37000UL)
#define I2C1_BASE             (APBPERIPH_BASE + 0x41000UL)
#define CAN1_BASE             (APBPERIPH_BASE + 0x61000UL)
#define QEI1_BASE             (APBPERIPH_BASE + 0x71000UL)
#define ECAP1_BASE            (APBPERIPH_BASE + 0x75000UL)
#define TRNG_BASE             (APBPERIPH_BASE + 0x79000UL)
#define USCI1_BASE            (APBPERIPH_BASE + 0x91000UL)
#define CRPT_BASE             (0x50080000UL)
#define SPIM_BASE             (0x40007000UL)

#define SC0_BASE             (APBPERIPH_BASE + 0x50000UL)
#define SC1_BASE             (APBPERIPH_BASE + 0x51000UL)
#define SC2_BASE             (APBPERIPH_BASE + 0x52000UL)
#define DAC0_BASE            (APBPERIPH_BASE + 0x07000UL)
#define DAC1_BASE            (APBPERIPH_BASE + 0x07040UL)
#define DACDBG_BASE          (APBPERIPH_BASE + 0x07FECUL)
#define OPA0_BASE            (APBPERIPH_BASE + 0x06000UL)

